Tekla.Structures.Drawing.Part.PartAttributes
The PartAttributes class is the attributes class for the part.

Tekla.Structures.Drawing.Part.PartAttributes.Representation
The representation of the part.

Tekla.Structures.Drawing.Part.PartAttributes.PartialProfileLength
Gets or sets the partial profile length.

Tekla.Structures.Drawing.Part.PartAttributes.PartialProfileOffset
Gets or sets the partial profile offset.

Tekla.Structures.Drawing.Part.PartAttributes.SymbolOffset
The symbol offset.

Tekla.Structures.Drawing.Part.PartAttributes.DrawHiddenLines
True if hidden lines are drawn.

Tekla.Structures.Drawing.Part.PartAttributes.DrawOwnHiddenLines
True if own hidden lines are drawn.

Tekla.Structures.Drawing.Part.PartAttributes.DrawCenterLine
True if the center line is drawn.

Tekla.Structures.Drawing.Part.PartAttributes.DrawReferenceLine
True if the reference line is drawn.

Tekla.Structures.Drawing.Part.PartAttributes.DrawOrientationMark
True if the orientation mark is drawn.

Tekla.Structures.Drawing.Part.PartAttributes.DrawConnectingSideMarks
True if connecting side marks are drawn.

Tekla.Structures.Drawing.Part.PartAttributes.DrawPopMarks
True if pop marks are drawn.

Tekla.Structures.Drawing.Part.PartAttributes.DrawChamfers
True if chamfers are drawn.

Tekla.Structures.Drawing.Part.PartAttributes.VisibleLines
The line type of visible lines.

Tekla.Structures.Drawing.Part.PartAttributes.SectionLines
The line type of section lines.

Tekla.Structures.Drawing.Part.PartAttributes.HiddenLines
The line type of hidden lines.

Tekla.Structures.Drawing.Part.PartAttributes.OwnHiddenLines
The line type of own hidden lines.

Tekla.Structures.Drawing.Part.PartAttributes.CenterLine
The line type of the center line.

Tekla.Structures.Drawing.Part.PartAttributes.ReferenceLine
The line type of the reference line.

Tekla.Structures.Drawing.Part.PartAttributes.FaceHatch
The hatch type of the face hatch.

Tekla.Structures.Drawing.Part.PartAttributes.SectionFaceHatch
The hatch type of the section face hatch.

Tekla.Structures.Drawing.Part.PartAttributes.CustomPresentation
Custom presentation GUID to be applied to the object type

Tekla.Structures.Drawing.Part.PartAttributes.#ctor(System.Boolean)
Creates a new default part attributes instance that doesn't load attributes.
SkipLoading value does make any difference.

Tekla.Structures.Drawing.Part.PartAttributes.#ctor
Creates a new default part attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Part.PartAttributes.#ctor(System.String)
Creates a new part attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.Part.PartAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Part.PartAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.